MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK82FN256VLL15/mcu.h
/*! @name CR - Control Register */
/*! @{ */
#define OTFAD_CR_FSVM_MASK                       (0x4U)
#define OTFAD_CR_FSVM_SHIFT                      (2U)
/*! FSVM - Force Security Violation Mode
 *  0b0..No effect on the operating mode.
 *  0b1..Force entry into SVM after a write with this data bit set and the data bit associated with FLDM cleared. SR[MODE] signals the operating mode.
 */
#define OTFAD_CR_FSVM(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_FSVM_SHIFT)) & OTFAD_CR_FSVM_MASK)
#define OTFAD_CR_FLDM_MASK                       (0x8U)
#define OTFAD_CR_FLDM_SHIFT                      (3U)
/*! FLDM - Force Logically Disabled Mode
 *  0b0..No effect on the operating mode.
 *  0b1..Force entry into LDM after a write with this data bit set. SR[MODE] signals the operating mode.
 */
#define OTFAD_CR_FLDM(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_FLDM_SHIFT)) & OTFAD_CR_FLDM_MASK)
#define OTFAD_CR_RRAE_MASK                       (0x80U)
#define OTFAD_CR_RRAE_SHIFT                      (7U)
/*! RRAE - Restricted Register Access Enable
 *  0b0..Register access is fully enabled. The OTFAD programming model registers can be accessed "normally".
 *  0b1..Register access is restricted and only the CR, SR and CRC can be accessed; others are treated as RAZ/WI.
 */
#define OTFAD_CR_RRAE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_RRAE_SHIFT)) & OTFAD_CR_RRAE_MASK)
#define OTFAD_CR_CCTX_MASK                       (0x30000U)
#define OTFAD_CR_CCTX_SHIFT                      (16U)
/*! CCTX - CRC Context
 *  0b00..Enable CTX0 CRC check.
 *  0b01..Enable CTX1 CRC check.
 *  0b10..Enable CTX2 CRC check.
 *  0b11..Enable CTX3 CRC check.
 */
#define OTFAD_CR_CCTX(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_CCTX_SHIFT)) & OTFAD_CR_CCTX_MASK)
#define OTFAD_CR_CRCE_MASK                       (0x100000U)
#define OTFAD_CR_CRCE_SHIFT                      (20U)
/*! CRCE - CRC Enable
 *  0b0..CRC-32 is disabled.
 *  0b1..CRC-32 for the context defined by CR[CCTRX] is enabled.
 */
#define OTFAD_CR_CRCE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_CRCE_SHIFT)) & OTFAD_CR_CRCE_MASK)
#define OTFAD_CR_CRCI_MASK                       (0x200000U)
#define OTFAD_CR_CRCI_SHIFT                      (21U)
/*! CRCI - CRC Initialization
 *  0b0..CRC data register is unaffected.
 *  0b1..CRC data register is immediately initialized after a write with this data bit set.
 */
#define OTFAD_CR_CRCI(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_CRCI_SHIFT)) & OTFAD_CR_CRCI_MASK)
#define OTFAD_CR_GE_MASK                         (0x80000000U)
#define OTFAD_CR_GE_SHIFT                        (31U)
/*! GE - Global OTFAD Enable
 *  0b0..OTFAD has decryption disabled, and bypasses all data fetched by the QuadSPI.
 *  0b1..OTFAD has decryption enabled, and processes fetched data as defined by the hardware configuration.
 */
#define OTFAD_CR_GE(x)                           (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_GE_SHIFT)) & OTFAD_CR_GE_MASK)
/*! @} */

/*! @name SR - Status Register */
/*! @{ */
#define OTFAD_SR_MDPCP_MASK                      (0x2U)
#define OTFAD_SR_MDPCP_SHIFT                     (1U)
#define OTFAD_SR_MDPCP(x)                        (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_MDPCP_SHIFT)) & OTFAD_SR_MDPCP_MASK)
#define OTFAD_SR_MODE_MASK                       (0xCU)
#define OTFAD_SR_MODE_SHIFT                      (2U)
/*! MODE - Operating Mode
 *  0b00..Operating in Normal mode (NRM)
 *  0b01..Unused (reserved)
 *  0b10..Operating in Security Violation Mode (SVM)
 *  0b11..Operating in Logically Disabled Mode (LDM)
 */
#define OTFAD_SR_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_MODE_SHIFT)) & OTFAD_SR_MODE_MASK)
#define OTFAD_SR_NCTX_MASK                       (0xF0U)
#define OTFAD_SR_NCTX_SHIFT                      (4U)
#define OTFAD_SR_NCTX(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_NCTX_SHIFT)) & OTFAD_SR_NCTX_MASK)
#define OTFAD_SR_HRL_MASK                        (0xF000000U)
#define OTFAD_SR_HRL_SHIFT                       (24U)
#define OTFAD_SR_HRL(x)                          (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_HRL_SHIFT)) & OTFAD_SR_HRL_MASK)
#define OTFAD_SR_RRAM_MASK                       (0x10000000U)
#define OTFAD_SR_RRAM_SHIFT                      (28U)
/*! RRAM - Restricted Register Access Mode
 *  0b0..Register access is fully enabled. The OTFAD programming model registers can be accessed "normally".
 *  0b1..Register access is restricted and only the CR, SR and CRC can be accessed; others are treated as RAZ/WI.
 */
#define OTFAD_SR_RRAM(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_RRAM_SHIFT)) & OTFAD_SR_RRAM_MASK)
#define OTFAD_SR_GEM_MASK                        (0x20000000U)
#define OTFAD_SR_GEM_SHIFT                       (29U)
/*! GEM - Global Enable Mode
 *  0b0..OTFAD is disabled, and bypasses all data fetched by the QuadSPI.
 *  0b1..OTFAD is enabled, and processes data fetched by the QuadSPI as defined by the hardware configuration.
 */
#define OTFAD_SR_GEM(x)                          (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_GEM_SHIFT)) & OTFAD_SR_GEM_MASK)
/*! @} */

/*! @name CRC - Cyclic Redundancy Check Register */
/*! @{ */
#define OTFAD_CRC_CRCD_MASK                      (0xFFFFFFFFU)
#define OTFAD_CRC_CRCD_SHIFT                     (0U)
#define OTFAD_CRC_CRCD(x)                        (((uint32_t)(((uint32_t)(x)) << OTFAD_CRC_CRCD_SHIFT)) & OTFAD_CRC_CRCD_MASK)
/*! @} */

/*! @name CTX_KEY - AES Key Word0..AES Key Word3 */
/*! @{ */
#define OTFAD_CTX_KEY_W0KEY_MASK                 (0xFFFFFFFFU)
#define OTFAD_CTX_KEY_W0KEY_SHIFT                (0U)
#define OTFAD_CTX_KEY_W0KEY(x)                   (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_KEY_W0KEY_SHIFT)) & OTFAD_CTX_KEY_W0KEY_MASK)
#define OTFAD_CTX_KEY_W1KEY_MASK                 (0xFFFFFFFFU)
#define OTFAD_CTX_KEY_W1KEY_SHIFT                (0U)
#define OTFAD_CTX_KEY_W1KEY(x)                   (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_KEY_W1KEY_SHIFT)) & OTFAD_CTX_KEY_W1KEY_MASK)
#define OTFAD_CTX_KEY_W2KEY_MASK                 (0xFFFFFFFFU)
#define OTFAD_CTX_KEY_W2KEY_SHIFT                (0U)
#define OTFAD_CTX_KEY_W2KEY(x)                   (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_KEY_W2KEY_SHIFT)) & OTFAD_CTX_KEY_W2KEY_MASK)
#define OTFAD_CTX_KEY_W3KEY_MASK                 (0xFFFFFFFFU)
#define OTFAD_CTX_KEY_W3KEY_SHIFT                (0U)
#define OTFAD_CTX_KEY_W3KEY(x)                   (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_KEY_W3KEY_SHIFT)) & OTFAD_CTX_KEY_W3KEY_MASK)
/*! @} */

/* The count of OTFAD_CTX_KEY */
#define OTFAD_CTX_KEY_COUNT                      (4U)

/* The count of OTFAD_CTX_KEY */
#define OTFAD_CTX_KEY_COUNT2                     (4U)

/*! @name CTX_CTR - AES Counter Word0..AES Counter Word1 */
/*! @{ */
#define OTFAD_CTX_CTR_W0CTR_MASK                 (0xFFFFFFFFU)
#define OTFAD_CTX_CTR_W0CTR_SHIFT                (0U)
#define OTFAD_CTX_CTR_W0CTR(x)                   (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_CTR_W0CTR_SHIFT)) & OTFAD_CTX_CTR_W0CTR_MASK)
#define OTFAD_CTX_CTR_W1CTR_MASK                 (0xFFFFFFFFU)
#define OTFAD_CTX_CTR_W1CTR_SHIFT                (0U)
#define OTFAD_CTX_CTR_W1CTR(x)                   (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_CTR_W1CTR_SHIFT)) & OTFAD_CTX_CTR_W1CTR_MASK)
/*! @} */

/* The count of OTFAD_CTX_CTR */
#define OTFAD_CTX_CTR_COUNT                      (4U)

/* The count of OTFAD_CTX_CTR */
#define OTFAD_CTX_CTR_COUNT2                     (2U)

/*! @name CTX_RGD - AES Region Descriptor Word0..AES Region Descriptor Word1 */
/*! @{ */
#define OTFAD_CTX_RGD_VLD_MASK                   (0x1U)
#define OTFAD_CTX_RGD_VLD_SHIFT                  (0U)
/*! VLD - Valid
 *  0b0..Context is invalid.
 *  0b1..Context is valid.
 */
#define OTFAD_CTX_RGD_VLD(x)                     (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_VLD_SHIFT)) & OTFAD_CTX_RGD_VLD_MASK)
#define OTFAD_CTX_RGD_ADE_MASK                   (0x2U)
#define OTFAD_CTX_RGD_ADE_SHIFT                  (1U)
/*! ADE - Aes Decryption Enable.
 *  0b0..Bypass the fetched data.
 *  0b1..Perform the CTR-AES128 mode decryption on the fetched data.
 */
#define OTFAD_CTX_RGD_ADE(x)                     (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_ADE_SHIFT)) & OTFAD_CTX_RGD_ADE_MASK)
#define OTFAD_CTX_RGD_RO_MASK                    (0x4U)
#define OTFAD_CTX_RGD_RO_SHIFT                   (2U)
/*! RO - Read-Only
 *  0b0..The context registers can be accessed normally (as defined by SR[RRAM]).
 *  0b1..The context registers are read-only and accesses may be further restricted based on SR[RRAM].
 */
#define OTFAD_CTX_RGD_RO(x)                      (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_RO_SHIFT)) & OTFAD_CTX_RGD_RO_MASK)
#define OTFAD_CTX_RGD_ENDADDR_MASK               (0xFFFFFC00U)
#define OTFAD_CTX_RGD_ENDADDR_SHIFT              (10U)
#define OTFAD_CTX_RGD_ENDADDR(x)                 (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_ENDADDR_SHIFT)) & OTFAD_CTX_RGD_ENDADDR_MASK)
#define OTFAD_CTX_RGD_SRTADDR_MASK               (0xFFFFFC00U)
#define OTFAD_CTX_RGD_SRTADDR_SHIFT              (10U)
#define OTFAD_CTX_RGD_SRTADDR(x)                 (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_SRTADDR_SHIFT)) & OTFAD_CTX_RGD_SRTADDR_MASK)
/*! @} */

